{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"filters": 24, "bias_constraint": null, "dtype": "float32", "data_format": "channels_last", "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "padding": "same", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "batch_input_shape": [null, 32, 32, 3], "trainable": true, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "Conv2D", "config": {"filters": 48, "bias_constraint": null, "padding": "valid", "data_format": "channels_last", "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_1", "trainable": true, "rate": 0.5, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"filters": 96, "bias_constraint": null, "padding": "same", "data_format": "channels_last", "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "Conv2D", "config": {"filters": 96, "bias_constraint": null, "padding": "valid", "data_format": "channels_last", "name": "conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "activation": "linear", "bias_regularizer": null, "use_bias": true, "kernel_constraint": null, "trainable": true, "strides": [1, 1], "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3], "kernel_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "pool_size": [2, 2], "trainable": true}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_2", "trainable": true, "rate": 0.5, "noise_shape": null}}, {"class_name": "Flatten", "config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "trainable": true, "name": "dense_1", "units": 128, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "Dropout", "config": {"seed": null, "name": "dropout_3", "trainable": true, "rate": 0.5, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "bias_regularizer": null, "trainable": true, "name": "dense_2", "units": 2, "use_bias": true, "activity_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_6"}}], "keras_version": "2.2.2"}##########['正常', '異常']